public/man/man1/coreutils.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - coreutils.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - coreutils.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>coreutils - single binary for coreutils programs</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>coreutils</strong> /–coreutils-prog=PROGRAM_NAME /[/PARAMETERS/]…</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Execute the PROGRAM_NAME built-in program with the given PARAMETERS.</p>
<dl>
<dt>
<strong>–help</strong>
</dt>
<dd>display this help and exit</dd>
<dt>
<strong>–version</strong>
</dt>
<dd>output version information and exit</dd>
</dl>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Built-in programs:
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<blockquote>
<p>[ b2sum base32 base64 basename basenc cat chcon chgrp chmod chown chroot
cksum comm cp csplit cut date dd df dir dircolors dirname du echo env
expand expr factor false fmt fold ginstall groups head hostid id join
kill link ln logname ls md5sum mkdir mkfifo mknod mktemp mv nice nl
nohup nproc numfmt od paste pathchk pinky pr printenv printf ptx pwd
readlink realpath rm rmdir runcon seq sha1sum sha224sum sha256sum
sha384sum sha512sum shred shuf sleep sort split stat stdbuf stty sum
sync tac tail tee test timeout touch tr true truncate tsort tty uname
unexpand uniq unlink uptime users vdir wc who whoami yes</p>
</blockquote>
<p>
Use: &#39;coreutils <strong>–coreutils-prog*=/PROGRAM_NAME/ *–help</strong>&#39; for
individual program help.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
AUTHOR
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>Written by Alex Deymo.</p>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
REPORTING BUGS
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>GNU coreutils online help: &lt;<a href="https://www.gnu.org/software/coreutils/">https://www.gnu.org/software/coreutils/</a>&gt;<br>
Report any translation bugs to &lt;<a href="https://translationproject.org/team/">https://translationproject.org/team/</a>&gt;</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
SEE ALSO
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>Full documentation &lt;<a href="https://www.gnu.org/software/coreutils/coreutils">https://www.gnu.org/software/coreutils/coreutils</a>&gt;<br>
or available locally via: info &#39;(coreutils) Multi-call invocation&#39;</p>
<p>
\\
Packaged by <a href="https://nixos.org">https://nixos.org</a><br>
Copyright © 2024 Free Software Foundation, Inc.<br>
License GPLv3+: GNU GPL version 3 or later
&lt;<a href="https://gnu.org/licenses/gpl.html">https://gnu.org/licenses/gpl.html</a>&gt;.<br>
This is free software: you are free to change and redistribute it.<br>
There is NO WARRANTY, to the extent permitted by law.</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
